In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_excel('score.xlsx',index_col='지원번호')
df

       이름    학교    키   국어   영어   수학  과학  사회        SW특기
지원번호
1번    강나래   구로고  197   90   85  100  95  85      Python
2번    강태원   구로고  184   40   35   50  55  25        Java
3번    강호림   구로고  168   80   75   70  80  75  Javascript
4번    김수찬   구로고  187   40   60   70  75  80         NaN
5번    김재욱   구로고  188   15   20   10  35  10         NaN
6번    박동현  디지털고  202   80  100   95  85  80           C
7번    박혜정  디지털고  188   55   65   45  40  35      PYTHON
8번    승근열  디지털고  190  100   85   90  95  95          C#

In [4]:
### 그룹화 ###
# .groupby()- ()해당 값 안에서 같은 것 끼리 그룹짓기
# .get_group() - 해당되는 그룹 보여줌

df.groupby('학교').get_group('구로고')

# .size() - 해당 그룹 수 확인
df.groupby('학교').size()
df.groupby('학교').size()['구로고']
df.groupby('학교').size()['디지털고']

# 학교별 '키' 평균값 출력
df.groupby('학교')['키'].mean()

학교
구로고     184.800000
디지털고    193.333333
Name: 키, dtype: float64

In [5]:
df.groupby('학교').count()

      이름  키  국어  영어  수학  과학  사회  SW특기
학교
구로고    5  5   5   5   5   5   5     3
디지털고   3  3   3   3   3   3   3     3

In [6]:
df.groupby('학교').size()

학교
구로고     5
디지털고    3
dtype: int64

그룹별 최대값,최소값,평균,합계

In [7]:
# 학교그룹별 '키' 평균값 출력
df.groupby('학교')['키'].mean()
# 학교그룹별 '키','국어' 평균값 출력
df.groupby('학교')[['키','국어']].mean()

# 학교그룹별 '키' 최대값 출력
df.groupby('학교')['키'].max()

학교
구로고     197
디지털고    202
Name: 키, dtype: int64

In [8]:
# 컬럼에서 최대값,최소값,평균,합계
df['키'].min()

np.int64(168)

In [9]:
# 학교그룹 별 최대값,최소값,평균,합계
df.groupby('학교')['키'].mean()

학교
구로고     184.800000
디지털고    193.333333
Name: 키, dtype: float64

In [10]:
# 컬럼 추가
df['학년'] = [3,3,2,1,3,2,2,1]
df

       이름    학교    키   국어   영어   수학  과학  사회        SW특기  학년
지원번호
1번    강나래   구로고  197   90   85  100  95  85      Python   3
2번    강태원   구로고  184   40   35   50  55  25        Java   3
3번    강호림   구로고  168   80   75   70  80  75  Javascript   2
4번    김수찬   구로고  187   40   60   70  75  80         NaN   1
5번    김재욱   구로고  188   15   20   10  35  10         NaN   3
6번    박동현  디지털고  202   80  100   95  85  80           C   2
7번    박혜정  디지털고  188   55   65   45  40  35      PYTHON   2
8번    승근열  디지털고  190  100   85   90  95  95          C#   1

In [11]:
df.groupby(['학교','학년']).size()

학교    학년
구로고   1     1
      2     1
      3     3
디지털고  1     1
      2     2
dtype: int64

In [12]:
df.groupby('학교')[['이름','SW특기']].count()

      이름  SW특기
학교
구로고    5     3
디지털고   3     3

In [13]:
df.groupby('학교').count()
df.groupby('학년')['이름'].count()

학년
1    2
2    3
3    3
Name: 이름, dtype: int64

In [14]:
df.groupby('학년').sum().sort_values('키')
df.groupby('학교').sum().sort_values('키')
df.groupby('학교')['키'].max()

학교
구로고     197
디지털고    202
Name: 키, dtype: int64

In [15]:
### 그룹화 ###
# df.groupby('컬럼명').
# 컬럼을 기준으로 그룹핑 - sum() - 합계, count() - 개수, size() - 크기
df.groupby('학교').size()
df.groupby(['학교','학년']).count()
# mean(),max(),min() -> 숫자타입 컬럼지정 필요  => df.groupby('컬럼명')['숫자타입컬럼']
df.groupby('학교')['키'].mean()
df.groupby('학교')[['키','국어']].mean()

df['학교'].value_counts()

## 그룹별로 키 기준 순차정렬
df.groupby('학년')['키'].mean().sort_values()
## 그룹별로 키 기준 역순정렬
df.groupby('학년')['키'].mean().sort_values(ascending=False)

## value_count() -> 그룹핑 시 사용되는 개수 함수
# 학교별로 그룹핑 한 후 구로고 학생의 학년으로 학생수 출력
df.groupby('학교')['학년'].value_counts().loc['구로고']

# value_count(nomalize=True)  => 퍼센트로 출력됨.
df.groupby('학교')['학년'].value_counts(normalize=True).loc['구로고']

학년
3    0.6
1    0.2
2    0.2
Name: proportion, dtype: float64

In [16]:
df.count()

이름      8
학교      8
키       8
국어      8
영어      8
수학      8
과학      8
사회      8
SW특기    6
학년      8
dtype: int64

In [17]:
# value_count() -> 그룹핑 시 사용되는 개수 함수
# 학교별로 그룹핑 한 후 학년으로 학생수 출력
school = df.groupby('학교')
school['학년'].value_counts()

학교    학년
구로고   3     3
      1     1
      2     1
디지털고  2     2
      1     1
Name: count, dtype: int64

In [18]:
## 학교별로 그룹핑 한 후 구로고 학생의 학년으로 학생수 출력
df.groupby('학교')['학년'].value_counts().loc['구로고']

# value_count(nomalize=True)  => 퍼센트로 출력됨.
df.groupby('학교')['학년'].value_counts(normalize=True).loc['구로고']

학년
3    0.6
1    0.2
2    0.2
Name: proportion, dtype: float64

In [19]:
# 구로고 학생의 키의 합계 를 구하시오.
df.groupby('학교')['키'].sum()

학교
구로고     924
디지털고    580
Name: 키, dtype: int64

In [20]:
df

       이름    학교    키   국어   영어   수학  과학  사회        SW특기  학년
지원번호
1번    강나래   구로고  197   90   85  100  95  85      Python   3
2번    강태원   구로고  184   40   35   50  55  25        Java   3
3번    강호림   구로고  168   80   75   70  80  75  Javascript   2
4번    김수찬   구로고  187   40   60   70  75  80         NaN   1
5번    김재욱   구로고  188   15   20   10  35  10         NaN   3
6번    박동현  디지털고  202   80  100   95  85  80           C   2
7번    박혜정  디지털고  188   55   65   45  40  35      PYTHON   2
8번    승근열  디지털고  190  100   85   90  95  95          C#   1

In [28]:
df.groupby('학교')['키'].min()
df.groupby('학교')['키'].mean()
df.groupby('학교')['키'].max()
df.groupby('학교')['키'].sum()
df.groupby('학교')['키'].agg(['min','mean','max','sum'])

      min        mean  max  sum
학교
구로고   168  184.800000  197  924
디지털고  188  193.333333  202  580

In [32]:
df['학교'].value_counts()

학교
구로고     5
디지털고    3
Name: count, dtype: int64